module.exports = {
  comments: {
    popular: [
      {
        id: 1,
        user: {
          id: 1,
          fullname: 'John Doe',
          avatarUrl:
            'https://leonardo.osnova.io/104b03b4-5173-fd9f-2af9-b458dddc4a23/-/scale_crop/108x108/-/format/webp/',
        },
        text: 'О да, напомнил про LG G4. Был у меня он с светлой коричневой кожей. Красиво, приятно на ощупь и уже через 2 месяца кожа облезла и пришлось покупать новую крышку. ',
        post: {
          id: 1,
          title: 'Экран водопад на любителя',
        },
        createdAt: new Date().toString(),
      },
      {
        id: 2,
        user: {
          id: 1,
          fullname: 'Jane Doe',
          avatarUrl:
            'https://leonardo.osnova.io/f2b74c5b-6387-15f0-e6d7-1d2eacc52c09/-/scale_crop/64x64/-/format/webp/',
        },
        text: 'О да, напомнил про LG G4. Был у меня он с светлой коричневой кожей. Красиво, приятно на ощупь и уже через 2 месяца кожа облезла и пришлось покупать новую крышку. ',
        post: {
          id: 1,
          title: 'Экран водопад на любителя',
        },
        createdAt: new Date().toString(),
      },
      {
        id: 3,
        user: {
          id: 1,
          fullname: 'Dug Doe',
          avatarUrl:
            'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/',
        },
        text: 'О да, напомнил про LG G4. Был у меня он с светлой коричневой кожей. Красиво, приятно на ощупь и уже через 2 месяца кожа облезла и пришлось покупать новую крышку. ',
        post: {
          id: 1,
          title: 'Экран водопад на любителя',
        },
        createdAt: new Date().toString(),
      },
    ],
    new: [
      {
        id: 3,
        user: {
          id: 1,
          fullname: 'Mob Doe',
          avatarUrl:
            'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/',
        },
        text: 'О да, напомнил про LG G4. Был у меня он с светлой коричневой кожей. Красиво, приятно на ощупь и уже через 2 месяца кожа облезла и пришлось покупать новую крышку. ',
        post: {
          id: 1,
          title: 'Экран водопад на любителя',
        },
        createdAt: new Date().toString(),
      },
      {
        id: 4,
        user: {
          id: 2,
          fullname: 'Sid Doe',
          avatarUrl:
            'https://leonardo.osnova.io/7161cd97-ffdc-1930-2b13-419de941c777/-/scale_crop/64x64/-/format/webp/',
        },
        text: 'ЖДУ не дождусь зимних покупок 😂❤🎉 так заинтересовал насчёт лоферы, кстати Кирилл как думаешь лучше в школу оксфорды крупные на платформе или лоферы либо мартинсы?',
        post: {
          id: 1,
          title: 'Экран водопад на любителя',
        },
        createdAt: new Date().toString(),
      },
    ],
  },
}
